package main

import "fmt"

// 用100文钱买一百只鸡，其中公鸡，母鸡，小鸡都必须要有，问公鸡，母鸡，小鸡要买多少只刚好凑足100文钱
// 公鸡 5文一只、母鸡 3文一只、小鸡 1文三只

/**
数学公式：
1.
公式1：x + y + z = 100
公式2：5x + 3y + z/3 = 100

2.
公式2：15x + 9y + z = 300
公式2 - 公式1： 14x + 8y = 200 -> 7x + 4y = 100

x = (100 - 4y) / 7
y = (100 - 7x) / 4 -> 25 - 7 * x / 4
z = 100 - x - y

由上可得 x 为 4 的倍数

x = 4, y = 18, z = 78
x = 8, y = 11, z = 81
x = 12, y = 4, z = 84
*/

func main() {
	for g := 1; g < 20; g++ {
		for m := 1; m < 33; m++ {
			x := 100 - g - m
			if (x%3 == 0) && ((5*g + 3*m + x/3) == 100) {
				fmt.Printf("公鸡: %d只，母鸡：%d只，小鸡 %d只\n", g, m, x)
			}
		}
	}
}
